In [1]:
import pandas as pd

In [2]:
file_location = 'sample_data.txt'
df = pd.read_csv(file_location)
df

    Name  Age      City  Temp
0  Alice   30    Austin  90.2
1    Bob   25    Dallas  91.9
2  Carol   35   Houston  93.5
3  David   40  San Jose  75.0
4    Eve   28    Austin  90.2

In [3]:
# Generate the WHERE clause using the 'IN' clause
names = df['Name'].apply(lambda x: f"'{x}'").str.cat(sep=', ')
names

"'Alice', 'Bob', 'Carol', 'David', 'Eve'"

In [4]:
where_clause = f"WHERE Name IN ({names})"
where_clause

"WHERE Name IN ('Alice', 'Bob', 'Carol', 'David', 'Eve')"